IDEA Open Model
TendonStressLoading Class
Compatible with IDEA StatiCa 20.1
 Tendon stress loading
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.Load.TendonLoading
 IdeaRS.OpenModel.Concrete.Load.TendonStressLoading
 Namespace: IdeaRS.OpenModel.Concrete.Load
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class TendonStressLoading : TendonLoading
Public Class TendonStressLoading
	Inherits TendonLoading
The TendonStressLoading type exposes the following members.
Constructors
Name | Description
TendonStressLoading
 Constructor
Top
Properties
Name | Description
Stresses
 Tendon stress
Top
See Also
Reference
IdeaRS.OpenModel.Concrete.Load Namespace